Projects/First_Benchmark/output/logs/int_queries/int_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 0.00 qps: 30892.18 (r/w/o: 0.00/3879.48/27012.71) lat (ms,95%): 0.00 err/s: 6.33 reconn/s: 0.00
[ 6s ] thds: 8 tps: 2.67 qps: 31118.75 (r/w/o: 0.00/4013.32/27105.43) lat (ms,95%): 0.00 err/s: 16.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 0.00 qps: 34960.53 (r/w/o: 0.00/4348.25/30612.28) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 2.67 qps: 30450.91 (r/w/o: 0.00/3959.77/26491.14) lat (ms,95%): 0.00 err/s: 19.69 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 33331.56 (r/w/o: 0.00/4166.44/29165.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 2.67 qps: 32021.82 (r/w/o: 0.00/4035.07/27986.75) lat (ms,95%): 0.00 err/s: 9.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 0.00 qps: 35000.69 (r/w/o: 0.00/4375.09/30625.61) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           89528
        other:                           619371
        total:                           708899
    transactions:                        32     (1.47 per sec.)
    queries:                             708899 (32609.08 per sec.)
    ignored errors:                      153    (7.04 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.7391s
    total number of events:              32

Latency (ms):
         min:                                 5256.93
         avg:                                 5434.44
         max:                                 5530.68
         95th percentile:                        0.00
         sum:                               173902.14

Threads fairness:
    events (avg/stddev):           4.0000/0.00
    execution time (avg/stddev):   21.7378/0.00