Projects/First_Benchmark/output/logs/int_queries/int_queries_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 488.10 qps: 488.10 (r/w/o: 488.10/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 495.03 qps: 495.03 (r/w/o: 495.03/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 493.99 qps: 493.99 (r/w/o: 493.99/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 492.68 qps: 492.68 (r/w/o: 492.68/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 495.28 qps: 495.28 (r/w/o: 495.28/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 495.08 qps: 495.08 (r/w/o: 495.08/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 493.31 qps: 493.31 (r/w/o: 493.31/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            10368
        write:                           0
        other:                           0
        total:                           10368
    transactions:                        10368  (493.39 per sec.)
    queries:                             10368  (493.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0136s
    total number of events:              10368

Latency (ms):
         min:                                   13.42
         avg:                                   16.21
         max:                                   40.42
         95th percentile:                        0.00
         sum:                               168037.69

Threads fairness:
    events (avg/stddev):           1296.0000/8.54
    execution time (avg/stddev):   21.0047/0.00